choice = None
choice_6 = None
choice_7 = None
a = [1, 2, 3, 5, 2, 'asd', 'a', 13, 4, 5, 9, 14, 23]

while choice != '0':
    print('1 - Проинициализировать список первыми N элементами заданного ряда(исходя из 5 лабы).')
    print('2 - Добавить элемент в производьное место массива.')
    print('3 - Удалить элемент производьное место из списока.')
    print('4 - Очистить список.')
    print('5 - Найти значение K-го экстремума в списке, если он является списком чисел.')
    print('6 - Найти наиболее длинную последовательность по варианту')
    print('7 - Найти последовательность, включающую в себя наибольшее количество элементов-cтрок, содержащих только гласные буквы.')
    print('8 - Вывести список.')
    print('0 - Выход.')
    
    choice = input('Выбор - ')
    
    if choice == '0':
        print('Выход')
    #вызов 8     
    elif choice == '8':
        if a == []:
            print('Список пустой.')
        else:
            print('\nСписок:')
            for i in a:
                print(a.index(i), ':', i)
    # вызов 1            
    elif choice == '1':
        print('Используйте код из лабы 5 чтобы заполнить ряд либло суммой либо рядом члена')
    #вызов 2        
    elif choice == '2':
        i = input('Введите int или str: ')
        index = int(input('Введите произвольное место элемента: '))

        if type(i) == str:
            if i.isdigit():
                i = int(i)
        a.insert(index, i)
    #вызов 3     
    elif choice == '3':
        index = int(input('Введите произвольное место элемента: '))
        if index < len(a):
            a.remove(a[index])
        else:
            print('Такого элемента с индексом -', index, 'нет.')
    #вызов 4        
    elif choice == '4':
        a = []
    #вызов 5    
    elif choice == '5':
        if a == []:
            print('Список пустой')
            break
        b = 0
        for i in a:
            if type(i) != int and type(i) != float:
                b += 1
        if b == 0:
            amax = max(a)
            amin = min(a)
            kmax = a.index(amax)
            kmin = a.index(amin)
            print('Максисальное значение списка(чисел):', amax)
            print('Максисальное значение списка(чисел):', amin)
            print('k-ый экстремум:', 'kmax -', kmax, 'kmin -', kmin)
        else:
            print('Список состоит не только из чисел, но и строк!')
        
    #вызов 6
    #--------------------------------------------------------------------------
    elif choice == '6':
        while choice_6 != '0':
            if a == []:
                print('Список пустой')
                break
            print('\nПункт 6:')
            print('1 - Убывающая последовательность целых чётных чисел.')
            print('2 - Возрастающая последовательность простых чисел.')
            print('3 - Последовательность чисел, в которой все, начиная с 3-го, являются суммой двух предыдущих.')
            print('4 - Знакочередующаяся последовательность нечётных чисел.')
            print('5 - Убывающая последовательность отрицательных чисел, модуль которых является простым числом.')
            print('8 - Вывести список.')
            print('0 - Выход.')
            choice_6 = input('Выбор п.6 - ')
            
            if choice_6 == '0':
                print('Выход')
                break;
            #вызов 6 - 1
            #--------------------------------------------------------------------------
            elif choice_6 == '1':
                b = a
                a = []
                for i in b:
                    if type(i) != str and i % 2 == 0  :
                        a.append(i)
                for j in range(len(a)):
                    for k in range(len(a)-j-1):
                        if a[k] < a[k+1]:
                            a[k],a[k+1] = a[k+1],a[k]
                #a = sorted(a, reverse = True)
        
            #вызов 6 - 2
            #--------------------------------------------------------------------------
            elif choice_6 == '2':
                b = a
                a = []
                for j in range(len(b)):
                    if type(b[j]) != str:
                        a.append(b[j])
                    for k in range(len(a)-j-1):
                            if a[k] > a[k+1]:
                                a[k],a[k+1] = a[k+1],a[k]
                #a = sorted(a)
            #вызов 6 - 3
            #--------------------------------------------------------------------------
            elif choice_6 == '3':
                if len(a) < 3:
                    print('В массиве недостаточно элементов!')
                else:
                    b = []
                    c = []
                    for i in range (len(a)):
                        if type(a[i]) == str or type(a[i-1]) == str or type(a[i-2]) == str or type(a[i-3]) == str:
                            continue
                        if i > 1:
                            if float(a[i-2]) + float(a[i-1]) == float(a[i]):
                                if i == 2:
                                    b.append(a[i-2])
                                    b.append(a[i-1])
                                elif float(a[i-3]) + float(a[i-2]) != float(a[i-1]):
                                    b.append(a[i-2])
                                    b.append(a[i-1])
                                b.append(a[i])
                                if i == len(a)-1:
                                    if len(b) > len(c):
                                        c = b
                            elif float(a[i-2]) + float(a[i-1]) != float(a[i]):
                                if len(b) > len(c):
                                    c = b
                                b = []
                    a = c
                    if a == []:
                        print('Нет такой последовательности')
                    else:
                        print('Ваш массив:',a)
            #вызов 6 - 4
            #--------------------------------------------------------------------------
            elif choice_6 == '4':
                b = a
                c = []
                a = []
                for i in b:
                    if type(i) != str and i % 2 != 0  :
                        c.append(i)
                for j in range(0, len(c)):
                     if j % 2 == 0:
                        a.append(abs(c[j]))
                     else:
                        a.append(-abs(c[j]))
            #вызов 6 - 5
            #--------------------------------------------------------------------------
            elif choice_6 == '5':
                b = a
                a = []
                for i in b:
                    if type(i) != str:
                        a.append(i)
                for j in range(len(a)):
                    for k in range(len(a)-j-1):
                        if a[k] < a[k+1]:
                            a[k],a[k+1] = a[k+1],a[k]
            #вызов 6 - 8
            #--------------------------------------------------------------------------
            elif choice_6 == '8':
                if a == []:
                    print('Список пустой.')
                else:
                    print('\nСписок:')
                    for i in a:
                        print(a.index(i), ':', i)
            #--------------------------------------------------------------------------
            else:
                print('Введенного номер нет', choice, 'для 6 пункта')
    #--------------------------------------------------------------------------
                        
    #вызов 7
    #--------------------------------------------------------------------------            
    elif choice == '7':
        while choice_7 != '0':
            if a == []:
                print('Список пустой')
                break
            print('\nПункт 7:')
            print('1 - Строк, содержащих только гласные буквы.')
            print('2 - Слов, где каждое последующее слово получается из букв предыдущего.')
            print('3 - Результата игры в слова (каждая последующая строка - слово, начинающееся с буквы, на которую закончилась предыдущая).')
            print('4 - Строк, содержащих удвоенные согласные.')
            print('5 - Строк, где гласных меньше, чем согласных.')
            print('8 - Вывести список.')
            print('0 - Выход.')
            choice_7 = input('Выбор п.7 - ')
            
            if choice_7 == '0':
                print('Выход')
                break;
            #вызов 7 - 1
            #--------------------------------------------------------------------------
            elif choice_7 == '1':
                b = a
                a = []
                c = 0
                for i in b:
                    if type(i) == int or type(i) == float:
                        continue
                    for j in range(0,len(i)):
                        if i[j] == 'a' or i[j] == 'e' or i[j] == 'i' or i[j] == 'e' or i[j] == 'o'  or i[j] == 'u'  or i[j] == 'y':
                            c = 0
                        elif i[j] == 'A' or i[j] == 'E' or i[j] == 'I' or i[j] == 'E' or i[j] == 'O'  or i[j] == 'U'  or i[j] == 'Y':
                            c = 0
                        else:
                            c+=1
                            break
                    if c == 0:
                        a.append(i)
        
            #вызов 7 - 2
            #--------------------------------------------------------------------------
            elif choice_7== '2':
                print()
            #вызов 7 - 3
            #--------------------------------------------------------------------------
            elif choice_7 == '3':
                print()
            #вызов 7 - 4
            #--------------------------------------------------------------------------
            elif choice_7 == '4':
                print()
            #вызов 7 - 5
            #--------------------------------------------------------------------------
            elif choice_7 == '5':
                print()
            #вызов 7 - 8
            #--------------------------------------------------------------------------
            elif choice_7 == '8':
                if a == []:
                    print('Список пустой.')
                else:
                    print('\nСписок:')
                    for i in a:
                        print(a.index(i), ':', i)
            #--------------------------------------------------------------------------
            else:
                print('Введенного номер нет', choice, 'для 7 пункта')    
    else:
        print('Введенного номер нет', choice)
    print('\n')

